# SetGlossiness Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
EffectInstance..::..SetGlossiness Method
EffectInstance Class See Also
---
Sets the glossiness parameter of the effect instance.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public void SetGlossiness(
	double glossiness
)
```

Visual Basic
---
```text
Public Sub SetGlossiness ( _
	glossiness As Double _
)
```

Visual C++
---
```text
public:
void SetGlossiness(
	double glossiness
)
```

# ### Parameters
glossiness
    Type: System..::..Double The glossiness value.
# See Also
EffectInstance Class
Autodesk.Revit.DB.DirectContext3D Namespace